Repository: oandregal/poss-gl
Catalog: tmx/ch03.tmx
Source language: en
Languages: gl

source: header, but most do, because it gives recipients a foolproof way to reach the author (it is especially useful when the author had to send from an address other than the one to which replies should be directed).
gl: mais as máis delas o levan, xa que lle ofrece ao destinatario un camiño seguro para acceder ao autor da mensaxe (o que é especialmente útil cando o autor tivo que enviar a mensaxe desde un enderezo distinto a aquel ao que desexa que se lle remitan as respostas).

source: Some mail reading software offers an easy-to-use interface for filing mails based on patterns in the Subject header. This leads people to request that the mailing list add an automatic prefix to all Subjects, so they can set their readers to look for that prefix and automatically file the mails in the right folder. The idea is that the original author would write:
gl: Algún software de lectura de correo ofrece unha interface de uso sinxelo para filtrar mensaxes baseándose en padróns do cabezallo "asunto". Isto fai que a xente pida que a lista engada un prefixo automático a todos os asuntos, de xeito que se poida configurar o programa para que recoñeza ese prefixo e arquive automaticamente na pasta correcta as mensaxes que o levan. A idea é que o autor da mensaxe escribiría:

source: Subject: Making the 2.5 release.
gl: Asunto: preparando a liberación 2.5.

source: but the mail would show up on the list looking like this:
gl: mais a mensaxe se vería na lista deste xeito:

source: Subject: [discuss@lists.example.org] Making the 2.5 release.
gl: Asunto: [discusions@listas.exemplo.org] preparando a liberación 2.5.

source: Although most list management software offers the option to do this, I strongly recommend against turning the option on. The problem it solves can easily be solved in much less obtrusive ways, and the cost of eating space in the Subject field is far too high. Experienced mailing list users typically scan the Subjects of the day's incoming list mail to decide what to read and/or respond to. Prepending the list's name to the Subject can push the right side of the Subject off the screen, rendering it invisible. This obscures information that people depend on to decide what mails to open, thus reducing the overall functionality of the mailing list for everyone.
gl: Aínda que a maioría dos programas de xestión de listas ofrecen esta opción, persoalmente recomendo non activala. O problema que resolve pode ser solucionado de maneira máis sinxela por métodos menos intrusivos, e o custo de reducir o espazo do cabezallo "asunto" é considerablemente superior. Os usuarios experimentados de listas de correo acostuman a ver os asuntos da lista de mensaxes entrantes do día para decidiren cal ler ou a cal responder. Se o nome da lista antecede o asunto, o contido deste pode ser desprazado cara ao lado dereito da pantalla, fóra do campo de visión. Isto oculta información que a xente necesita para decidiren que mensaxes abrir, reducindo así a utilidade xeral da lista para todo o mundo.

source: Instead of munging the Subject header, teach your users to take advantage of the other standard headers, starting with the To header, which should say the mailing list's name:
gl: En troca de mudar excesivamente o cabezallo "asunto", aprende aos teus usuarios a tiraren partido de outros cabezallos estándar, comezando polo cabezallo "para", que debería conter o nome da lista:

source: To: &lt;discuss@lists.example.org&gt;
gl: Para: &lt;discusión@listas.exemplo.org&gt;

source: Any mail reader that can filter on Subject should be able to filter on To just as easily.
gl: Calquera lector de correo que poida filtrar o "asunto" debería tamén poder filtrar o "para" coa mesma facilidade.

source: There are a few other optional-but-standard headers expected for mailing lists. Filtering on these is even more reliable than using the "To" or "Cc" headers; since these headers are added to each post by the mailing list management software itself, some users may be counting on their presence:
gl: Hai uns poucos cabezallos máis de listas de correo que son opcionais mais estándar. Filtralos é mesmo máis preciso que facelo sobre os "para" ou "CC"; dado que estes cabezallos son engadidos ás mensaxes polo propio software de xestión de listas, algúns usuarios poden contar coa súa presenza:

source: list-help: &lt;mailto:discuss-help@lists.example.org&gt; list-unsubscribe: &lt;mailto:discuss-unsubscribe@lists.example.org&gt; list-post: &lt;mailto:discuss@lists.example.org&gt; Delivered-To: mailing list discuss@lists.example.org Mailing-List: contact discuss-help@lists.example.org; run by ezmlm
gl: axuda-lista: &lt;mailto:discuss-help@lists.example.org&gt; baixa-lista: &lt;mailto:discuss-unsubscribe@lists.example.org&gt; envio-a-lista: &lt;mailto:discuss@lists.example.org&gt; Distribuído-a:: mailing list discuss@lists.example.org Lista: contactar discuss-help@lists.example.org; run by ezmlm

source: For the most part, they are self-explanatory. See <ulink url="http://www.nisto.com/listspec/list-manager-intro.html"></ulink> for more explanation, or if you need the really detailed, formal specification, see <ulink url="http://www.faqs.org/rfcs/rfc2369.html"></ulink>.
gl: Os máis deles son obvios. Consulta <ulink url="http://www.nisto.com/listspec/list-manager-intro.html"></ulink> para máis explicacións, ou se precisares especificacións realmente detalladas e formais, podes ver <ulink url="http://www.faqs.org/rfcs/rfc2369.html"></ulink>.

source: Notice how these headers imply that if you have a mailing list named "list", then you also have administrative addresses "list-help" and "list-unsubscribe" available. In addition to these, it is normal to have "list-subscribe", for joining, and "list-owner", for reaching the list administrators. Depending on the list management software you use, these and/or various other administrative addresses may be set up; the documentation will have details. Usually a complete explanation of all these special addresses is mailed to each new user as part of an automated "welcome mail" on subscribing. You yourself will probably get a copy of this welcome mail. If you don't, then ask someone else for a copy, so you know what your users are seeing when they join the list. Keep the copy handy so you can answer questions about the mailing list functions, or better yet, put it on a web page somewhere. That way when people lose their own copy of the instructions and post to ask "How do I unsubscribe from this list?", you can just hand them the URL.
gl: Ten en conta que estes cabezallos implican que, se tiveres unha lista denominada "lista", tamén vas dispor de enderezos administrativos "axuda-lista" e "baixa-lista". Ademais, é habitual ter "subscrición-lista" para cadastrarse, e "propietario-lista" para contactar cos seus administradores. Xeralmente se envía automaticamente a explicación sobre a utilidade e todos estes enderezos aos novos subscritores como parte dunha mensaxe de benvida. Probablemente ti mesmo teñas copia desta mensaxes de benvida. Se non for así, pídelle a alguén que cha pase, para que poidas coñecer o que é que os teus usuarios reciben cando se dan de alta na lista. Ten a copia a man de xeito que poidas responder preguntas sobre o funcionamento da lista ou, mesmo mellor, publícaa nalgunha páxina web. Deste xeito, cando alguén perda a súa copia e che mande unha mensaxe preguntando "Como podo darme de baixa nesta lista?, ti só terás que enviarlle a correspondente URL.

source: Some mailing list software offers an option to append unsubscription instructions to the bottom of every post. If that option is available, turn it on. It causes only a couple of extra lines per message, in a harmless location, and it can save you a lot of time, by cutting down on the number of people who mail you&mdash;or worse, mail the list!&mdash;asking how to unsubscribe.
gl: Algúns programas de listas de correo ofrecen unha opción para engadir ao pé das mensaxes as instrucións para darse de baixa. Se for así, actívaa. Só produce un par de liñas de máis por mensaxe, nunha localización onde non estorban, e pode aforrarche unha boa cantidade de tempo diminuíndo a cantidade de xente que che envía consultas &mdash;ou peor, que manda unha mensaxe á lista!&mdash;preguntando como darse de baixa.

source: The Great Reply-to Debate
gl: O Gran debate sobre "responder-a" (Reply-To)

source: Earlier, in <xref linkend="avoid-private-discussions"/>, I stressed the importance of making sure discussions stay in public forums, and talked about how active measures are sometimes needed to prevent conversations from trailing off into private email threads; furthermore, this chapter is all about setting up project communications software to do as much of the work for you as possible. Therefore, if the mailing list management software offers a way to automatically cause discussions to stay on the list, you would think turning that feature on would be the obvious choice.
gl: Antes, en <xref linkend="evita discusións privadas"/>, salientei a importancia de manter discusións seguras nos foros públicos, e falei sobre como é as veces necesario adoptar medidas activas para evitares a conversión de discusións en fíos privados; máis adiante, este capítulo trata completamente sobre a configuración do software de comunicacións para que faga por ti tanto traballo como for posible. Polo tanto, se o software de administración ofrece unha maneira automatizada para evitar que se establezan discusións na lista, deberías pensar que activar esa opción é a decisión obvia.

source: Well, not quite. There is such a feature, but it has some pretty severe disadvantages. The question of whether or not to use it is one of the hottest debates in mailing list management&mdash;admittedly, not a controversy that's likely to make the evening news in your city, but it can flare up from time to time in free software projects. Below, I will describe the feature, give the major arguments on both sides, and make the best recommendation I can.
gl: Ou talvez non tanto. Existe esa utilidade, mais presenta algunhas desvantaxes realmente importantes. A cuestión de se usala ou non constitúe un dos debates máis quentes no mundo da xestión de listas&mdash;admitámolo, non unha controversia como para saír nas noticias da noite na túa cidade, mais si que pode xurdir de tempo en tempo en todo proxecto de software libre. Máis adiante describirei esta utilidade, darei os principais argumentos a favor e en contra, e darei a mellor recomendación que poida.

source: The feature itself is very simple: the mailing list software can, if you wish, automatically set the Reply-to header on every post to redirect replies to the mailing list. That is, no matter what the original sender puts in the Reply-to header (or even if they don't include one at all), by the time the list subscribers see the post, the header will contain the list address:
gl: A utilidade en si mesma é moi simple: o software de listas de correo pode, se ti queres, configurar automaticamente o cabezallo "responder-a" (Reply-to) en todas as mensaxes, de xeito que as respostas se encamiñen á propia lista. Isto é, independentemente do que o remitente poña no cabezallo "contestar a "(e mesmo se non poñen nada en absoluto), cando os subscritores vexan a mensaxe, o cabezallo conterá o enderezo da lista:

source: Reply-to: discuss@lists.example.org
gl: Responder a: discusións@listas.exemplo.org

source: On its face, this seems like a good thing. Because virtually all mail reading software pays attention to the Reply-to header, now when anyone responds to a post, their response will be automatically addressed to the entire list, not just to the sender of the message being responded to. Of course, the responder can still manually change where the message goes, but the important thing is that <emphasis>by default</emphasis> replies are directed to the list. It's a perfect example of using technology to encourage collaboration.
gl: De primeiras, parece unha boa idea. Xa que practicamente todo o software de lectura de correo ten en conta o cabezallo "responder a", cando alguén responder a unha mensaxe, a súa resposta vai ser automaticamente dirixida a toda a lista, non só ao remitente da mensaxe orixinal. Por suposto, quen contesta pode mudar manualmente o destinatario da súa mensaxe, mais o importante é que <emphasis>por defecto</emphasis> as respostas son dirixidas á lista. É un exemplo perfecto do uso da tecnoloxía para fomentar a colaboración.

source: Unfortunately, there are some disadvantages. The first is known as the <firstterm>Can't Find My Way Back Home</firstterm> problem: sometimes the original sender will put their "real" email address in the Reply-to field, because for one reason or another they send email from a different address than where they receive it. People who always read and send from the same location don't have this problem, and may be surprised that it even exists. But for those who have unusual email configurations, or who cannot control how the From address on their mails looks (perhaps because they send from work and do not have any influence over the IT department), using Reply-to may be the only way they have to ensure that responses reach them. When such a person posts to a mailing list that he's not subscribed to, his setting of Reply-to becomes essential information. If the list software overwrites it, he may never see the responses to his post.
gl: Infelizmente, hai algunhas desvantaxes. A primeira é coñecida como o problema de <firstterm>Non podo dar co camiño de volta</firstterm>: ás veces o remitente pon o seu enderezo "real" de correo electrónico no cabezallo "responder a", porque por unha razón ou outra envía o seu correo desde un enderezo distinto de onde o recibe. A xente que sempre envía a recibe o seu correo desde o mesmo enderezo non ten este problema, e pode que se sorprenda mesmo de que exista. Mais para aqueles que teñen configuracións de coreo inusitadas, ou que non poden controlar que enderezo ocupa o campo "de" das súas mensaxes (talvez porque envían os correos desde o seu traballo e non teñen influencia ningunha sobre o seu departamento de TI), usar o "responder a" pode ser a única maneira de asegurar que lles chegan as respostas. Cando alguén así publica algunha mensaxe nunha lista á que non está subscrito, a súa configuración do "responder a" tórnase unha información esencial. Se o software da lista sobrescribe esa información, é posible que nunca chegue a ver as respostas á súa mensaxe.

source: The second disadvantage has to do with expectations, and in my opinion is the most powerful argument against Reply-to munging. Most experienced mail users are accustomed to two basic methods of replying: <firstterm>reply-to-all</firstterm> and <firstterm>reply-to-author</firstterm>. All modern mail reading software has separate keys for these two actions. Users know that to reply to everyone (that is, including the list), they should choose reply-to-all, and to reply privately to the author, they should choose reply-to-author. Although you want to encourage people to reply to the list whenever possible, there are certainly circumstances where a private reply is the responder's prerogative&mdash;for example, they may want to say something confidential to the author of the original message, something that would be inappropriate on the public list.
gl: A segunda desvantaxe ten a ver coas expectativas, e na miña opinión é o argumento máis poderoso contra o uso de forzar o "responder a". Os usuarios de correo electrónico máis experimentados están afeitos a dous métodos básicos de resposta:<firstterm>"responder a todos"</firstterm> e <firstterm>"responder ao remitente"</firstterm>. Todos os programas de lectura de correo electrónico modernos teñen botóns diferentes para estas dúas accións. Os usuarios saben que para responder a todo o mundo (incluíndo a lista) deben escoller "responder a todos", e para responder en privado ao autor orixinal, deben escoller "responder ao remitente". Aínda que desexes fomentar que a xente responda á lista sempre que for posible, hai certas circunstancias nas que a resposta privada é unha decisión de quen responde&mdash;por exemplo, poden querer dicirlle algo confidencial ao autor da mensaxe inicial, algo que resultaría inapropiado publicar na lista.

source: Now consider what happens when the list has overridden the original sender's Reply-to. The responder hits the reply-to-author key, expecting to send a private message back to the original author. Because that's the expected behavior, he may not bother to look carefully at the recipient address in the new message. He composes his private, confidential message, one which perhaps says embarrassing things about someone on the list, and hits the send key. Unexpectedly, a few minutes later his message appears <emphasis>on the mailing list!</emphasis> True, in theory he should have looked carefully at the recipient field, and should not have assumed anything about the Reply-to header. But authors almost always set Reply-to to their own personal address (or rather, their mail software sets it for them), and many longtime email users have come to expect that. In fact, when a person deliberately sets Reply-to to some other address, such as the list, he usually makes a point of mentioning this in the body of the message, so people won't be surprised at what happens when they reply.
gl: E agora considera o que pasa cando a lista sobrescribe o "responder a" do remitente orixinal. Quen responde pulsa a tecla de "responder ao remitente", esperando que a mensaxe lle sexa enviada directamente ao autor orixinal. Xa que ese é o comportamento esperado, pode que non se preocupe de comprobar o enderezo do destinatario na nova mensaxe. Compón a súa mensaxe privada e confidencial, que quizais conteña cousas embarazosas sobre alguén da lista, e preme a tecla de enviar. De súpeto, poucos minutos máis tarde, a mensaxe aparece <emphasis>na lista!</emphasis>. Certo, en teoría el tiña que ter comprobado convenientemente o que puña no campo "destinatario", e moitos usuarios expertos esperan que se faga así. De feito, cando alguén configura o "responder a" con calquera outro enderezo, como a da lista, xeralmente ten o coidado de mencionar este feito no corpo da mensaxe, de xeito que a xente non se sorprenda do que pasa cando responden.

source: Because of the possibly severe consequences of this unexpected behavior, my own preference is to configure list management software to never touch the Reply-to header. This is one instance where using technology to encourage collaboration has, it seems to me, potentially dangerous side-effects. However, there are also some powerful arguments on the other side of this debate. Whichever way you choose, you will occasionally get people posting to your list asking why you didn't choose the other way. Since this is not something you ever want as the main topic of discussion on your list, it might be good to have a canned response ready, of the sort that's more likely to stop discussion than encourage it. Make sure you do <emphasis>not</emphasis> insist that your decision, whichever it is, is obviously the only right and sensible one (even if you think that's the case). Instead, point out that this is a very old debate, there are good arguments on both sides, no choice is going to satisfy all users, and therefore you just made the best decision you could. Politely ask that the subject not be revisited unless someone has something genuinely new to say, then stay out of the thread and hope it dies a natural death.
gl: Como resultado das consecuencias deste comportamento inesperado, a miña preferencia pasa por configurar o software de xestión da lista de xeito que nunca toque o cabezallo "responder a". Esta é unha das ocasións nas que usar a tecnoloxía para fomentar a colaboración ten, paréceme, efectos colaterais potencialmente perniciosos. En calquera caso, hai tamén algúns argumentos poderosos a favor do outro bando deste debate. Independentemente do que decidas, recibirás de cando en vez mensaxes de xente preguntando por que non o escolles a outra maneira. Como seguramente non queres que esta cuestión se converta no principal fío da lista, sería bo que tiveses preparada unha resposta por anticipado, das do tipo que conducen ao abandono da discusión, en lugar de fomentala. Debes estar seguro de que <emphasis>non</emphasis> insistes en que a túa decisión, sexa esta a que for, é a única correcta (aínda que o penses). Pola contra, explica que este é un debate moi vello, que hai boas razóns nos dous bandos, que ningunha escolla vai satisfacer a todos os usuarios, e que por tanto tomaches a mellor decisión posible. Moi amablemente indica que non se debe reiniciar a discusión sobre a materia salvo que alguén tiver algo realmente novo que dicir, despois mantente á marxe do fío e espera a que morra de morte natural.

source: Someone may suggest a vote to choose one way or the other. You can do that if you want, but I personally do not feel that counting heads is a satisfactory solution in this case. The penalty for someone who is surprised by the behavior is so huge (accidentally sending a private mail to a public list), and the inconvenience for everyone else is fairly slight (occasionally having to remind someone to respond to the whole list instead of just to you), that it's not clear that the majority, even though they are the majority, should be able to put the minority at such risk.
gl: Alguén pode suxerir que se faga unha votación para decidir unha solución ou a outra. Podes facelo se quixeres, mais persoalmente non me parece que contar cabezas sexa unha boa maneira de resolver a cuestión. O castigo para quen é sorprendido polo comportamento do software da lista (enviando por accidente unha mensaxe privada á lista) é tan grande, e os inconvenientes para os demais son tan leves (tendo que recordarlle de tanto en tanto a alguén que responda á lista en troca de ao teu enderezo privado), que non está claro que a maioría, aínda que sexa precisamente maioría, poida poñer a minoría en tal risco.

source: I have not addressed all aspects of this issue here, just the ones that seemed of overriding importance. For a full discussion, see these two canonical documents, which are the ones people always cite when they're having this debate:
gl: Non estou a tratar aquí todos os aspectos do asunto, tan só aqueles que semellan ser da maior importancia. Para un tratamento máis completo, le estes dous documentos canónicos, que son os que sempre se citan cando xorde este debate:

source: Despite the mild preference indicated above, I do not feel there is a "right" answer to this question, and happily participate in many lists that <emphasis>do</emphasis> set Reply-to. The most important thing you can do is settle on one way or the other early, and try not to get entangled in debates about it after that.
gl: Apesar da miña lixeira preferencia indicada antes, non creo que haxa unha única resposta "correcta" para esta cuestión, e de feito participo en moitas listas que escolleron <emphasis>empregar</emphasis> o "responder a". O mellor que podes facer é decidirte por unha ou outra solución o antes posible, e tratar de non enredarte en debates sobre o tema máis adiante.

source: Two fantasies
gl: Dúas fantasías
